In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('./datasets/data_social_network_ads.csv')
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [3]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [52]:
df.describe()

              Age  EstimatedSalary   Purchased       False
count  400.000000       400.000000  400.000000  400.000000
mean    -0.510000        -0.510000    0.490000    0.490000
std      0.500526         0.500526    0.500526    0.500526
min     -1.000000        -1.000000    0.000000    0.000000
25%     -1.000000        -1.000000    0.000000    0.000000
50%     -1.000000        -1.000000    0.000000    0.000000
75%      0.000000         0.000000    1.000000    1.000000
max     -0.000000        -0.000000    1.000000    1.000000

In [35]:
# df.loc[ df["Gender"] == "Male", "Gender"] = 0
# df.loc[ df["Gender"] == "Female", "Gender"] = 1
# df
# df.drop(['User ID'],axis=1,inplace=True)
# df

In [44]:
def norm(feature):
    df[feature] = (df[feature] - df[feature].min()) / (df[feature].min() - df[feature].max())

norm('Age')
norm("EstimatedSalary")
df

    Gender  Age  EstimatedSalary  Purchased  False
0        1 -0.0             -0.0          1      1
1        1 -0.0             -0.0          1      1
2        0 -1.0             -1.0          0      0
3        0 -1.0             -1.0          0      0
4        1 -0.0             -0.0          1      1
..     ...  ...              ...        ...    ...
395      0 -1.0             -1.0          0      0
396      1 -0.0             -0.0          1      1
397      0 -1.0             -1.0          0      0
398      1 -0.0             -0.0          1      1
399      0 -1.0             -1.0          0      0

[400 rows x 5 columns]

In [45]:
from sklearn.model_selection import train_test_split

X = df[['Gender','Age','EstimatedSalary']]
Y = df['Purchased']

X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.3)

In [50]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

lr = LogisticRegression()
lr.fit(X_train , Y_train)
y_pred = lr.predict(X_test)

accuracy = accuracy_score(Y_test,y_pred)
accuracy

1.0

In [51]:
from sklearn.metrics import confusion_matrix

cm = confusion_matrix(Y_test,y_pred)
cm

array([[62,  0],
       [ 0, 58]])

In [54]:
TN , FP , FN , TP = cm.ravel()
print("TN : ",TN)
print("FP : ",FP)
print("FN : ",FN)
print("TP : ",TP)

TN :  62
FP :  0
FN :  0
TP :  58

In [ ]:
accuracy = (TP + TN)/(TN , FP + FN + TP )